package db

type Question struct {
	TextFromUser   string
	TextFromOthers string
	Options        []string
}

var QUESTIONS = []Question{
	{
		TextFromUser:   "کدوم رو بیشتر دوس داری؟",
		TextFromOthers: "کدوم رو بیشتر دوس دارم؟",
		Options: []string{
			"پفک",
			"چیپس",
			"لواشک",
			"پاستیل",
		},
	},
	{
		TextFromOthers: "توی کدوم شبکه اجتماعی فعالیت بیشتری داری؟",
		TextFromUser:   "توی کدوم شبکه اجتماعی فعالیت بیشتری دارم؟",
		Options: []string{
			"واتساپ",
			"تلگرام",
			"فیس بوک",
			"توییتر",
			"اینستاگرام",
		},
	},
	{
		TextFromOthers: "کدوم سبک فیلم رو بیشتر نگاه میکنی؟",
		TextFromUser:   "کدوم سبک فیلم رو بیشتر نگاه میکنه؟",
		Options: []string{
			"فیلمای کره ایی",
			"سریال های طنز",
			"انیمه",
			"فیلم های ترکیه ایی",
			"سریال ایرانی",
		},
	},
	{
		TextFromOthers: "رابطت با موسیقی چطوره؟",
		TextFromUser:   "رابطش با موسیقی چطوره؟",
		Options: []string{
			"سبک الکترونیک",
			"برای خودش متال هده!",
			"اینستامنتال ها ، مثل پیانو",
			"رپ و ترپ",
			"پاپ",
			"سنتی",
			"راک",
		},
	},
	{
		TextFromOthers: "کجا رو ترجیح میدی؟",
		TextFromUser:   "کجا رو ترجیح میده؟",
		Options: []string{
			"یک خونه چوبی وسط جنگل",
			"ویلا کنار ساحل",
			"زندگی توی یک شهر بزرگ. پر از نئون.",
			"زندگی فعلی!",
			"شهری با قدمت تاریخی",
		},
	},
	{
		TextFromOthers: "ترجیح میدی ست لباست چه رنگی باشه؟",
		TextFromUser:   "ترجیح میده ست لباسش چه رنگی باشه؟",
		Options: []string{
			"زرد",
			"گلبه ایی",
			"قرمز",
			"مشکی",
			"زرشکی",
			"آبی",
			"صورتی",
		},
	},
	{
		TextFromOthers: "دوس داری کجا بری مسافرت؟",
		TextFromUser:   "دوس داره کجا بره مسافرت؟",
		Options: []string{
			"شهر های تاریخی ایران",
			"طبیعت ایران",
			"اروپا",
			"آسیای شرقی",
			"هند",
			"آمریکا",
			"آفریقا",
		},
	},
	{
		TextFromOthers: "دوس داری زندگیت چطور باشه؟",
		TextFromUser:   "دوس داره زندگیش چطور باشه؟",
		Options: []string{
			"پر از هیجان",
			"آروم",
			"خنده دار!",
			"پر از ماجراجویی",
			"حس خوب کنار یک نفر",
		},
	},
	{
		TextFromOthers: "کدوم بحث ها رو بیشتر دوس داری؟",
		TextFromUser:   "کدوم بحث ها رو بیشتر دوس داره؟",
		Options: []string{
			"سیاسی",
			"تاریخی",
			"دور مورد تکنولوژی",
			"در مورد کتاب",
			"هنر",
			"غذا",
			"غیبت",
		},
	},
	{
		TextFromOthers: "توی جمع ها چطور آدمی هستی؟",
		TextFromUser:   "توی جمع چطور آدمیه؟",
		Options: []string{
			"کسی که کنترل جمع رو به دست میگیره",
			"سعی میکنه دوست جدید پیدا کنه",
			"از بقیه دوری میکنه",
			"فقط با آشنا ها حس خوب میگیره",
			"غریبه ها رو به آشنا ها ترجیح میده",
		},
	},
	{
		TextFromOthers: "اگه فردا اخرین روز زندگیت باشه ، چیکار میکنی؟",
		TextFromUser:   "اگه فردا اخرین روز زندگیش باشه ، چیکار میکنه؟",
		Options: []string{
			"میخوابه!",
			"فقط میخوره!",
			"فسق و فجور",
			"فقط گریه میکنه",
			"سعی میکنه تا آخرین لحظش رو استفاده کنه",
		},
	},
	{
		TextFromOthers: "آی او اس یا اندروید؟",
		TextFromUser:   "آی او اس یا اندروید؟",
		Options: []string{
			"آی او اس",
			"اندروید",
			"جاوا مرحوم",
		},
	},
	{
		TextFromOthers: "کدوم ساز؟",
		TextFromUser:   "کدوم ساز؟",
		Options: []string{
			"پیانو",
			"گیتار",
			"ویولن",
			"سه تار",
			"دف",
			"تمبک",
			"قانون",
		},
	},
}
